# Pandas

### Missing data

We will go through the methods on how to handle the missing data in pandas dataframe

In [36]:
# Import pandas and numpy
import pandas as pd
import numpy as np

In [37]:
# Create pandas data frame with NaN values
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [38]:
# Display the df
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Drop the columns or rows with null value
- axis = 0 for row
- axis = 1 for column

In [39]:
# Drop rows with null values
df.dropna() # default axis = 0

     A    B  C
0  1.0  5.0  1

In [40]:
df.dropna(axis = 0)

     A    B  C
0  1.0  5.0  1

In [41]:
# Drop column with null values
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [43]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Filling values to the null values

In [44]:
# Fill null values with a constant value
df.fillna(value = 100)

       A      B  C
0    1.0    5.0  1
1    2.0  100.0  2
2  100.0  100.0  3

In [45]:
df.fillna(value = "Null Value")

            A           B  C
0         1.0         5.0  1
1         2.0  Null Value  2
2  Null Value  Null Value  3

In [46]:
# Fill the null values with mean
df.fillna(value = df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [47]:
# Select first column and fill null values with the mean of the column
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

The groupby method are used to group the rows of data together and call aggregate functions

In [48]:
# Create a Dictionary to convert into dataframe
data = {'Department': ['Finance', 'Admin', 'HR', 'Development', 'HR', 'Finance'],
        'Person': ['Jack', 'John', 'Amy', 'Jane', 'Sam', 'Harry'],
        'Salary': [20000, 40000, 25000, 50000, 34000, 70000]}

In [49]:
# Load the dictionary as dataframe
df = pd.DataFrame(data)

In [51]:
# Display the dataframe
df

    Department Person  Salary
0      Finance   Jack   20000
1        Admin   John   40000
2           HR    Amy   25000
3  Development   Jane   50000
4           HR    Sam   34000
5      Finance  Harry   70000


Now you can use the .groupby() method to group rows together based off of a column name. Here lets group the data based on the department This will create a DataFrameGroupBy object:

In [52]:
# Use groupby to group the data by Department
df.groupby('Department')

In [53]:
# save the previous groupby object to a varible by_dept
by_dept = df.groupby('Department')

Now we can call the aggregate methods on this groupby object.

In [54]:
# Get the mean of all columns grouped by department
by_dept.mean()

              Salary
Department
Admin        40000.0
Development  50000.0
Finance      45000.0
HR           29500.0

In [55]:
# Get the minimum of all columns grouped by department
by_dept.min()

            Person  Salary
Department
Admin         John   40000
Development   Jane   50000
Finance      Harry   20000
HR             Amy   25000

In [58]:
# Get the maximum of all columns grouped by department
by_dept.max()

            Person  Salary
Department
Admin         John   40000
Development   Jane   50000
Finance       Jack   70000
HR             Sam   34000

In [61]:
# Get the count of all columns grouped by department
by_dept.count()

             Person  Salary
Department
Admin             1       1
Development       1       1
Finance           2       2
HR                2       2

In [62]:
# Get the description of by_dept object
by_dept.describe()

            Salary                                                             \
             count     mean           std      min      25%      50%      75%
Department
Admin          1.0  40000.0           NaN  40000.0  40000.0  40000.0  40000.0
Development    1.0  50000.0           NaN  50000.0  50000.0  50000.0  50000.0
Finance        2.0  45000.0  35355.339059  20000.0  32500.0  45000.0  57500.0
HR             2.0  29500.0   6363.961031  25000.0  27250.0  29500.0  31750.0


                 max
Department
Admin        40000.0
Development  50000.0
Finance      70000.0
HR           34000.0

In [64]:
# Get only the count of salary from the previous description
by_dept.describe()['Salary']['count']

Department
Admin          1.0
Development    1.0
Finance        2.0
HR             2.0
Name: count, dtype: float64

If we want to see the description of only certain department than we have to use the following command

In [65]:
# Check the description of HR department only
by_dept.describe().transpose()['HR']

Salary  count        2.000000
        mean     29500.000000
        std       6363.961031
        min      25000.000000
        25%      27250.000000
        50%      29500.000000
        75%      31750.000000
        max      34000.000000
Name: HR, dtype: float64